// 1 - Добавить
// 2 - Изменить
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Если СтруктураПараметров.Команда = "Добавить" Тогда 
			Команда = 1;
		ИначеЕсли СтруктураПараметров.Команда = "Изменить" Тогда
		КонецЕсли;
		ЭтотОбъект.Номенклатура = СтруктураПараметров.ТекСтрока.Номенклатура;
		ЭтотОбъект.КоличествоДоступно = СтруктураПараметров.ТекСтрока.ВНаличииОстаток;
		ЭтотОбъект.Серия = СтруктураПараметров.ТекСтрока.Серия;
		ЭтотОбъект.Упаковка = СтруктураПараметров.ТекСтрока.Упаковка; 
		Если СтруктураПараметров.ТекСтрока.Упаковка.Числитель > 1 Тогда
			ЭтотОбъект.КоличествоУпаковок = СтруктураПараметров.ТекСтрока.КоличествоУпаковок;
			ЭтотОбъект.Числитель = СтруктураПараметров.ТекСтрока.Упаковка.Числитель;  
		Иначе
			Элементы.КоличествоУпаковок.Видимость = Ложь; 
			ЭтотОбъект.КоличествоУпаковок = СтруктураПараметров.ТекСтрока.КоличествоУпаковок;
			ЭтотОбъект.Числитель = 1;
		КонецЕсли;
		
			
	//Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
	//	ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
	//	ЗаполнитьФорму(СтруктураПараметров.ДокументЗаказПеремещения,СтруктураПараметров.СтрокаДокументЗаказПеремещения);
	//Иначе
	//	Отказ = Истина;
	 КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)

	РезультатСервера = ПроверитьКоличество();

	Если НЕ РезультатСервера.Успех Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	КонецЕсли;
	  
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	РезультатСервера = ПроверитьКоличество();
	Если НЕ РезультатСервера.Успех Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	Иначе	
		ЭтаФорма.Закрыть();
	КонецЕсли;
 
КонецПроцедуры


&НаСервере
Функция ПроверитьКоличество()
	Перем Результат;
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, ""); 
	Если ЭтотОбъект.Количество <> Цел(ЭтотОбъект.Количество) И ЭтотОбъект.Числитель>1 Тогда
		Результат.ТекстОшибки = "Введите корректное количество";
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество * ЭтотОбъект.Числитель <= ЭтотОбъект.КоличествоДоступно Тогда
		Результат.Успех = Истина;
	Иначе
		Результат.ТекстОшибки = "Количество превышает остаток";
	КонецЕсли;
	Возврат Результат;
КонецФункции 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеПоступления(Значение) Экспорт
	ЭтотОбъект.Количество = 0;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	СтуктураВозврат.Вставить("Серия",ЭтотОбъект.Серия);
	СтуктураВозврат.Вставить("КоличествоУпаковок",ЭтотОбъект.Количество);
	СтуктураВозврат.Вставить("Количество",ЭтотОбъект.Количество*ЭтотОбъект.Числитель);
	СтуктураВозврат.Вставить("Упаковка",ЭтотОбъект.Упаковка);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры


