
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.Номенклатура <> "" Тогда
    	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура",СтруктураПараметров.Номенклатура);
    	Список.Параметры.УстановитьЗначениеПараметра("Склад",СтруктураПараметров.Склад);
    	Список.Параметры.УстановитьЗначениеПараметра("текДата",ТекущаяДата());
		
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	К = СписокВТЗ();
	
	Если К > 1 И ВыбраннаяСтрока<>1 Тогда
		Ответ = Вопрос("Имеются более ранее партии, Продолжить?",//"Ордер собран",//"Разместить ордер ?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Вопрос" // (необ.) заголовок
		//"По данному ордеру все собрано !!!"
		);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
	 		ВыборНаСервере(Элемент.ТекущиеДанные.Серия,Элемент.ТекущиеДанные.ДоступныйОстаток);
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		ВыборНаСервере(Элемент.ТекущиеДанные.Серия,Элемент.ТекущиеДанные.ДоступныйОстаток);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры   


&НаСервере
Процедура ВыборНаСервере(Серия,ДоступныйОстаток)
	ЭтаФорма.СерииНоменклатуры = Серия;
	ЭтаФорма.ДоступныйОстаток = ДоступныйОстаток;
	ЭтаФорма.Упаковка = Серия.СХК_Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("СерииНоменклатуры",ЭтаФорма.СерииНоменклатуры);
	СтуктураВозврат.Вставить("ДоступныйОстаток",ЭтаФорма.ДоступныйОстаток);
	СтуктураВозврат.Вставить("Упаковка",ЭтаФорма.Упаковка);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры


&НаСервере
Функция СписокВТЗ()
    // Получаем СКД с текстом запроса
    СКД_запрос = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    // Получаем настройки пользователя (отборы, сортировки и т. п.)
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД_запрос, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

    ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТЗ = ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);

    Возврат ТЗ.Количество();
КонецФункции