
&Перед("ОбработкаПроверкиЗаполнения")
Процедура Расш1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ЖелаемаяДатаПоступления = Дата(1,1,1) Тогда
		Сообщить("Заполните желаемую дату поступления");
		Отказ = Истина;                              
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Товары Цикл
		Если Не ПоискДублейЗаказВП(СтрокаТЧ.Номенклатура) Тогда
			ТекстПроверки = " " + НСтр("ru='в строке %НомерСтроки% списка ""Товары"" обнаружены дубли'");
			ТекстПроверки = СтрЗаменить(ТекстПроверки,"%НомерСтроки%", СтрокаТЧ.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстПроверки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, ""),
				,
				Отказ);
		КонецЕсли;		
	
	КонецЦикла;	
КонецПроцедуры


Функция ПоискДублейЗаказВП(ТНоменклатура)
	Отбор = Новый Структура("Номенклатура,ВариантОбеспечения",ТНоменклатура,Перечисления.ВариантыОбеспечения.КОбеспечению);
	Строки = Товары.НайтиСтроки(Отбор);
	Если Строки.Количество()>1 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
