#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если ЗначениеЗаполнено(СтруктураПараметров.Номенклатура) Тогда
		ЭтотОбъект.ДокОснования = СтруктураПараметров.ДокОснования;
		ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;
		ЭтотОбъект.СерииНоменклатуры = СтруктураПараметров.СерииНоменклатуры;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.Элементы.ШК.РедактированиеТекста = Истина;
	Элементы.ШК.ОбновитьТекстРедактирования();
	Элементы.ШК.Видимость = Ложь;
	Элементы.ШК.Видимость = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ГенерацияШК(Текст);	 
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум = ПечатьНаСерверШК(ТаблДокум,Текст); 
	ТаблДокум.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСерверШК(ТаблДокум,ШК)
	Обработка = РеквизитФормыВЗначение("Объект"); 
	
	ТаблДокум.Очистить();
	ТипМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетШК");	
	
	ОбластьШапка = ТипМакет.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Номенклатура	 = Строка(ЭтотОбъект.Номенклатура) + Символы.ПС + Строка(ЭтотОбъект.СерииНоменклатуры);  
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          1197);
	ПараметрыШтрихкода.Вставить("Высота",          421);
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(СХК_ТСДСклад.ПоискШтрихКодаНоменклатура(ЭтотОбъект.Номенклатура)[0].ШтрихКод));
	ТипКода = СХК_ТСДСклад.ОпределитьТипШтрихкода(ШК);
	Если ТипКода = "EAN128" Тогда
		ЧислоКода = 2;
	ИначеЕсли ТипКода = "CODE128" Тогда
		ЧислоКода = 4;
	ИначеЕсли ТипКода = "CODE39" Тогда
		ЧислоКода = 3;
	Иначе
		ЧислоКода = 1;
	КонецЕсли;
	
			
		
		
	ПараметрыШтрихкода.Вставить("ТипКода",         Число(ЧислоКода)); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    56);
	
	ОбластьШапка.Рисунки.ШтрихКод.Картинка= ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	//ОбластьПодвал.Рисунки["ШтрихКод"].Картинка = "";
	ТаблДокум.Вывести(ОбластьШапка); 
	ТаблДокум.ПолеСверху = 15;
	ТаблДокум.ПолеСнизу = 0;
	ТаблДокум.ПолеСлева  = 0;
	ТаблДокум.ПолеСправа  = 0;
	ТаблДокум.РазмерКолонтитулаСверху   = 0;
	ТаблДокум.РазмерКолонтитулаСнизу   = 0;
	ТаблДокум.Автомасштаб = Истина;  
	ТаблДокум.РазмерСтраницы="Letter";//нестандартный размер бумаги
	ТаблДокум.ВысотаСтраницы=71;
	ТаблДокум.ШиринаСтраницы=100;		
	
	Возврат ТаблДокум; 
	
КонецФункции  

&НаСервере
Функция ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода) 
	
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	Если  РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		Возврат РезультатОперации.Картинка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ГенерацияШК(ТекстШК) 
	Парам = Новый Структура;
	Парам.Вставить("Номенклатура",Номенклатура);
	
	Если СХК_ТСДСклад.ПоискШтрихКодаНоменклатура(Номенклатура).Количество() = 0 Тогда 
		Парам.Вставить("СерииНоменклатуры",Справочники.СерииНоменклатуры.ПустаяСсылка());
		СХК_ТСДСклад.СоздатьШтрихкод(Парам);		 
	КонецЕсли; 
	Парам.Вставить("СерииНоменклатуры",СерииНоменклатуры);
	
	Парам.Вставить("Основание",ДокОснования);
	Парам.Вставить("ШтрихКод",ТекстШК);
	СХК_ТСДСклад.ЗаписатьНовыйШтрихкодНоменклатурыПоступления(Парам);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтменитьШК(Команда) 
	ГенерацияШКОтмена();
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум = ПечатьНаСерверШК(ТаблДокум,""); 
	ТаблДокум.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ГенерацияШКОтмена() 
	Парам = Новый Структура;
	Парам.Вставить("Номенклатура",Номенклатура);
	
	Если СХК_ТСДСклад.ПоискШтрихКодаНоменклатура(Номенклатура).Количество() = 0 Тогда 
		Парам.Вставить("СерииНоменклатуры",Справочники.СерииНоменклатуры.ПустаяСсылка());
		СХК_ТСДСклад.СоздатьШтрихкод(Парам);		 
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

