
&НаКлиенте
Процедура Расш1_БанковскийСчетПриИзмененииПосле(Элемент)
	//++shishkin@syspod.ru #89832                                   
	Если	 ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "СчетИзКонтрагента")  
		И БанковскийСчет <> ЭтаФорма.СчетИзКонтрагента Тогда 
		
		БанковскийСчет = ЭтаФорма.СчетИзКонтрагента;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменение счета организации для заказа клиента доступно только в контрагенте!";
		Сообщение.Сообщить();
	КонецЕсли;	
	//shishkin@syspod.ru #89832
	
КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++shishkin@syspod.ru #89832
	СсылкаНаОбъект = Неопределено;
	Параметры.Свойство("Ссылка", СсылкаНаОбъект);
	Если СсылкаНаОбъект <> Неопределено Тогда
		Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
			СчетИзКонтрагента = Новый РеквизитФормы("СчетИзКонтрагента",Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций")); 
			ДобавляемыеРеквизиты.Добавить(СчетИзКонтрагента);	
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
			ЭтаФорма.СчетИзКонтрагента = __СпОбщийМодуль.ЗаполнитьБанковскийСчет(СсылкаНаОбъект.Контрагент);
			Если БанковскийСчет <> ЭтаФорма.СчетИзКонтрагента Тогда
				БанковскийСчет = ЭтаФорма.СчетИзКонтрагента;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	//--shishkin@syspod.ru #89832
	
КонецПроцедуры




