
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ plotnikov@syspod.ru #84483
	БанковскийСчетИР = ПолучитьБанковскийСчетИмяРеквизита();
	Если БанковскийСчетИР <> Неопределено Тогда
		БанковскийСчет = ЭтаФорма.Элементы[БанковскийСчетИР];
		БанковскийСчет.РежимВыбораИзСписка = Истина;
		//++shishkin@syspod.ru #91048
		//БанковскийСчет.УстановитьДействие("ПриИзменении", "БанковскиеСчетаНачалоВыбораИзСписка");	
		ЗаполнитьСписокВыбора(БанковскийСчет);
		Если БанковскийСчет.СписокВыбора.Количество() = 0 Тогда
			Реквизиты = ЭтотОбъект.Объект.Партнер.ДополнительныеРеквизиты;
			ОрганизацияРек = Справочники.Организации.ПустаяСсылка();
			Для каждого Рек Из Реквизиты Цикл
				Если Рек.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Организация (Общие)") Тогда;
					ОрганизацияРек = Рек.Значение;	
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(ОрганизацияРек) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не заполнены банковские счета у %1.", ОрганизацияРек);
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
		//++shishkin@syspod.ru #91048
	КонецЕсли;
	//-- plotnikov@syspod.ru #84483
КонецПроцедуры

Функция ПолучитьБанковскийСчетИмяРеквизита()
	мБК = Этаформа.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Наименование", "!Банковский счет для заказов"));
	Если мБК.Количество() > 0 Тогда
		Возврат мБК[0].ИмяРеквизитаЗначение;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Процедура БанковскиеСчетаНачалоВыбораИзСписка(Элемент)
//++shishkin@syspod.ru #91048
//	//++ plotnikov@syspod.ru #84483
//	БанковскийСчетИР = ПолучитьБанковскийСчетИмяРеквизита();
//	Если  БанковскийСчетИР <> Неопределено Тогда
//		Счет = ЭтотОбъект[БанковскийСчетИР];
//		Счет = Элемент.СписокВыбора[0].Значение;
//	КонецЕсли;
//	//-- plotnikov@syspod.ru #84483
//--shishkin@syspod.ru #91048
КонецПроцедуры


Процедура ЗаполнитьСписокВыбора(БанковскийСчет)
	//++ plotnikov@syspod.ru #84483
	Реквизиты = ЭтотОбъект.Объект.Партнер.ДополнительныеРеквизиты;
	Для каждого Рек Из Реквизиты Цикл
		Если Рек.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Организация (Общие)") Тогда;
			ОрганизацияРек = Рек.Значение;	
		КонецЕсли;
	КонецЦикла;
	//++shishkin@syspod.ru #91048
	Если Не ЗначениеЗаполнено(ОрганизацияРек) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена организация у партнера. Список банковских счетов недоступен.";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	//--shishkin@syspod.ru #91048
	Запрос1 = Новый Запрос("
	|ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.Владелец.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И БанковскиеСчетаОрганизаций.Закрыт = &Закрыт");
	
	Запрос1.УстановитьПараметр("ГоловнаяОрганизация", ОрганизацияРек);
	Запрос1.УстановитьПараметр("Закрыт", Ложь);
	
	РезультатЗапроса = Запрос1.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		БанковскийСчет.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	//-- plotnikov@syspod.ru #84483
	
КонецПроцедуры

&НаСервере
Функция ПроверитьБанковскийСчет()
	Если Объект.Партнер.Клиент Тогда
		БанковскийСчетИР = ПолучитьБанковскийСчетИмяРеквизита();  
		Возврат ЗначениеЗаполнено(ЭтотОбъект[БанковскийСчетИР]);  	Иначе
		Возврат истина;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Расш1_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)  
	Если Не ПроверитьБанковскийСчет() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните Банковский счет для заказов на вкладке Дополнительно",5,"Внимание!!!");
	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры
