
&Вместо("РазузловатьСпецификациюИзделий")
Процедура Расш1_РазузловатьСпецификациюИзделий(ПараметрыРасчета, ПотребностиКРазузлованию)
	СтруктураДанных = ПараметрыРасчета.СтруктураДанных;
	ЕстьПриоритет = СтруктураДанных.Множители.Колонки.Найти("Приоритет") <> Неопределено;
	
	// Разузлование спецификаций.
	ПараметрыВыборкиДанных = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных();
	ПараметрыВыборкиДанных.ПереопределениеНастройкиПартииВыпуска.Использовать = Истина;
	ПараметрыВыборкиДанных.ОкруглятьКоличествоШтучныхТоваров = Ложь;
	ПараметрыВыборкиДанных.РассчитыватьДолиСтоимостиВыходныхИзделий = Истина;
	ПараметрыВыборкиДанных.ОбъединитьМатериалыИВыполняемыеРаботы = Истина;
	
	// Для разузлования ПФ, у которых в спецификации СпособПолучения = Обеспечивать
	// В регистре сведений "ВариантыОбеспеченияТоварами" должна быть запись для этого ПФ с способом обеспечения потребностей = "Собственное производство"
	// В функции ниже смотри запрос формирования в #Область МатериалыИУслуги
	// Разузлование будет работать, если в данной таблице, для ПФ, колонка Запланировать = Истина
	Потребности = Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоСпискуНоменклатуры(
		ПотребностиКРазузлованию,
		ПараметрыВыборкиДанных);
	
	// Заполнение дат производства в зависимости от длительности этапов.
	// Одновременное выполнение этапов не поддерживается.
	ПериодКалькуляции = ПараметрыРасчета.РеквизитыПК.Дата;
	ЗаполнитьДатыПроизводства(Потребности, ПериодКалькуляции);

	РазузлованныеОбъекты = Новый ТаблицаЗначений;
	РазузлованныеОбъекты.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	РазузлованныеОбъекты.Колонки.Добавить("КлючПартия", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	
	КоличествоПолуфабрикатов = Потребности.Количество();
	Индекс = 0;
	
	// Обработка результата разузлования.
	// Расчет множителей полуфабрикатов.
	Пока Индекс < КоличествоПолуфабрикатов Цикл
		
		ДанныеСпецификации = Потребности[Индекс];
		ИндексИзделия = ПотребностиКРазузлованию[Индекс].ИндексИзделия;
		Множитель = СтруктураДанных.Множители[ИндексИзделия];
		
		// Основное изделие это структура
		УидХарактеристики = Строка(ДанныеСпецификации.ОсновноеИзделие.Характеристика.УникальныйИдентификатор());
		
		РасчетПланаПроизводства.ПроброситьПеремещения(ДанныеСпецификации.МатериалыИУслуги);
		
		ДолиСтоимости = ДанныеСпецификации.ВыходныеИзделия.Итог("ДоляСтоимости");
		
		Если ДолиСтоимости = 0 Тогда
			ДолиСтоимости = 1;
		КонецЕсли;
		Числитель = 1;
		Знаменатель = 1;
		
		Для Каждого ВыходноеИзделие Из ДанныеСпецификации.ВыходныеИзделия Цикл
			
			#Область УсловиеВыходногоИзделия
			// В спецификации может быть множество выходных изделий,
			// нам необходимо только разузловываемое выходное изделие.
			Если Множитель.Полуфабрикат = Справочники.Номенклатура.ПустаяСсылка() Тогда
				Если Множитель.Продукция <> ВыходноеИзделие.Номенклатура Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(Множитель.ХарактеристикаПродукции)
					И ЗначениеЗаполнено(ВыходноеИзделие.Характеристика)
					И Множитель.ХарактеристикаПродукции <> ВыходноеИзделие.Характеристика Тогда
					Продолжить;
				КонецЕсли;
				
				Множитель.Период = ДанныеСпецификации.Окончание;
			Иначе
				Если Множитель.ПартияСпецификацияПолуфабриката <> ДанныеСпецификации.Спецификация Тогда
					Продолжить;
				КонецЕсли;
				Если Множитель.Полуфабрикат <> ВыходноеИзделие.Номенклатура Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(Множитель.ХарактеристикаПолуфабриката)
					И ЗначениеЗаполнено(ВыходноеИзделие.Характеристика)
					И Множитель.ХарактеристикаПолуфабриката <> ВыходноеИзделие.Характеристика Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
				
			ДоляСтоимости = 1;// ?(ВыходноеИзделие.ДоляСтоимости = 0, 1, ВыходноеИзделие.ДоляСтоимости);
				
			// Комментарий 750.
			// Изменение числителя и знаменателя, под данные из ресурсной спецификации.
			// Должна быть учтена доля стоимости и минимальное количество запуска.
			Числитель = Множитель.КоличествоПолуфабриката * ДоляСтоимости;
			Знаменатель = ВыходноеИзделие.Количество; // Множитель.КоличествоПолуфабриката;
			
			Множитель.Числитель = Множитель.КоличествоПолуфабриката;
			Множитель.Знаменатель = Множитель.КоличествоПолуфабриката;
				
			// Можем сюда попасть после расчета дин. структуры,
			// поэтому КлючПартия может отличатся от УИД характеристики, обновляем значение.
			Множитель.КлючПартия = ?(ЗначениеЗаполнено(Множитель.Полуфабрикат), Строка(
				Множитель.ХарактеристикаПолуфабриката.УникальныйИдентификатор()), Строка(
				Множитель.ХарактеристикаПродукции.УникальныйИдентификатор()));
			Множитель.РасчетЗавершен = Истина;

			Для Каждого СтрокаМатериала Из ДанныеСпецификации.МатериалыИУслуги Цикл

				Если Не (СтрокаМатериала.Запланировать Или СтрокаМатериала.Производится) Тогда
					Продолжить;
				КонецЕсли;

				НовыйМножитель = СтруктураДанных.Множители.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйМножитель, Множитель,
					"ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, Калькуляция");

				Если СтрокаМатериала.СпособПолученияМатериала
					= Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации Тогда
					НовыйМножитель.ПартияСпецификацияПолуфабриката = СтрокаМатериала.Спецификация;
				Иначе
					НовыйМножитель.ПартияСпецификацияПолуфабриката = Неопределено;
				КонецЕсли;
				НовыйМножитель.Подразделение = ПараметрыРасчета.РеквизитыПК.ПодразделениеДиспетчер;

				НовыйМножитель.Период = ДанныеСпецификации.Начало;
				НовыйМножитель.Полуфабрикат = СтрокаМатериала.Номенклатура;
				НовыйМножитель.ХарактеристикаПолуфабриката = СтрокаМатериала.Характеристика;
				НовыйМножитель.КлючПартия = Строка(СтрокаМатериала.Характеристика.УникальныйИдентификатор());
				НовыйМножитель.Порядок = Множитель.Порядок + 1;

				ОтборПозиций = Новый Структура("Период, ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, ПартияСпецификацияПолуфабриката, Полуфабрикат, ХарактеристикаПолуфабриката, Порядок");
				ЗаполнитьЗначенияСвойств(ОтборПозиций, НовыйМножитель);
				ОтборПозиций.Вставить("КлючПартия", НовыйМножитель.КлючПартия);
				ОтборПозиций.Вставить("РасчетЗавершен", Истина);
				РассчитанныеПозиции = СтруктураДанных.Множители.НайтиСтроки(ОтборПозиций);
				Для Каждого РассчитаннаяПозиция Из РассчитанныеПозиции Цикл

					Если НовыйМножитель.Порядок > РассчитаннаяПозиция.Порядок Тогда
						Продолжить;
					КонецЕсли;

					НовыйМножитель.Порядок = РассчитаннаяПозиция.Порядок + 1;

				КонецЦикла;

				НовыйМножитель.КоличествоПолуфабриката = Окр(СтрокаМатериала.Количество * Числитель / Знаменатель, 7);
					
				// Тут бесполезно что либо кроме 1, так как при разузловке полуфабриката значения поменяются,
				// см. комментарий 750.
				НовыйМножитель.Числитель = 1;
				НовыйМножитель.Знаменатель = 1;

				НовыйМножитель.Стоимость = 0;
				НовыйМножитель.СтоимостьБезНДС = 0;
				НовыйМножитель.СтоимостьРегл = 0;
				НовыйМножитель.Трудозатраты = 0;
				НовыйМножитель.ТрудозатратыРегл = 0;
				НовыйМножитель.ПостатейныеПостоянные = 0;
				НовыйМножитель.ПостатейныеПостоянныеБезНДС = 0;
				НовыйМножитель.ПостатейныеПостоянныеРегл = 0;
				НовыйМножитель.ПостатейныеПеременные = 0;
				НовыйМножитель.ПостатейныеПеременныеБезНДС = 0;
				НовыйМножитель.ПостатейныеПеременныеРегл = 0;
				НовыйМножитель.СтоимостьЗабалансовая = 0;
				НовыйМножитель.СтоимостьЗабалансоваяРегл = 0;
				Если ЕстьПриоритет Тогда
					НовыйМножитель.Приоритет = ?(ЗначениеЗаполнено(НовыйМножитель.Полуфабрикат), 1, 0);
				КонецЕсли;

				НовыйМножитель.РасчетЗавершен = Ложь;
				НовыйМножитель.ПартияВыпущена = Ложь;

			КонецЦикла;
			
		КонецЦикла;
					
		СпецификацияСХарактеристикой = Новый Структура("Спецификация, КлючПартия",
			ДанныеСпецификации.Спецификация, УидХарактеристики);
		
		ПараметрыРасчетаПериода = ПараметрыРасчетаПериода();
		ПараметрыРасчетаПериода.Период = НачалоДня(ДанныеСпецификации.Начало);
		ПараметрыРасчетаПериода.Этапы = ДанныеСпецификации.Этапы;
		ПараметрыРасчетаПериода.ДлительностиЭтапов = ДанныеСпецификации.Этапы.ВыгрузитьКолонку("ДлительностьЭтапа");
		
		ЭтапыНаСтороне = ДанныеСпецификации.Этапы.НайтиСтроки(Новый Структура("ПроизводствоНаСтороне", Истина));
		Для Каждого ЭтапНаСтороне Из ЭтапыНаСтороне Цикл
			
			ПлановыеМатериальныеЗатраты = СтруктураДанных.Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений
			
			ПараметрыРасчетаПериода.ТекущийЭтап = ЭтапНаСтороне.Этап;
			ПериодЗатратЭтапа = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);
			
			Для Каждого ТекУслуга Из ЭтапНаСтороне.УслугиПереработчика Цикл
				
				НоваяУслуга = ПлановыеМатериальныеЗатраты.Добавить();
				НоваяУслуга.Период 				= ПериодКалькуляции;
				НоваяУслуга.ПартияСпецификация 	= ДанныеСпецификации.Спецификация;
				НоваяУслуга.Подразделение 		= ЭтапНаСтороне.Подразделение;
				НоваяУслуга.СтатьяКалькуляции 	= ТекУслуга.СтатьяКалькуляции;
				НоваяУслуга.Номенклатура 		= ТекУслуга.Номенклатура;
				НоваяУслуга.Характеристика 		= ТекУслуга.Характеристика;
				НоваяУслуга.Количество 			= ТекУслуга.Количество * Числитель / Знаменатель;
				НоваяУслуга.ПериодЗатрат 		= ПериодЗатратЭтапа;
				НоваяУслуга.КлючПартия 			= УидХарактеристики;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ПроизводимыеПолуфабрикаты = ДанныеСпецификации.МатериалыИУслуги.СкопироватьКолонки("Номенклатура,Характеристика,СтатьяКалькуляции,Этап");
		Для Каждого СтрокаМатериала Из ДанныеСпецификации.МатериалыИУслуги Цикл
			
			ПлановыеМатериальныеЗатраты = СтруктураДанных.Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений
			НовыйМатериал = ПлановыеМатериальныеЗатраты.Добавить();
			НовыйМатериал.КлючПартия = УидХарактеристики;
			НовыйМатериал.Период = ПериодКалькуляции;
			НовыйМатериал.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НовыйМатериал.Подразделение = СтрокаМатериала.ПодразделениеЭтапа;
			НовыйМатериал.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
			НовыйМатериал.Номенклатура = СтрокаМатериала.Номенклатура;
			НовыйМатериал.Характеристика = СтрокаМатериала.Характеристика;
			НовыйМатериал.Количество = СтрокаМатериала.КоличествоУпаковок * Числитель / Знаменатель
											* СтрокаМатериала.ДанныеУпаковки.Числитель / СтрокаМатериала.ДанныеУпаковки.Знаменатель;
			
			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаМатериала.Этап;
			НовыйМатериал.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);
			
			Если СтрокаМатериала.Запланировать ИЛИ СтрокаМатериала.Производится Тогда
				НовыйМатериал.ЭтоПолуфабрикат = Истина;
				Если СтрокаМатериала.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе Тогда
					НовыйПолуфабрикат = ПроизводимыеПолуфабрикаты.Добавить();
					НовыйПолуфабрикат.Номенклатура = СтрокаМатериала.Номенклатура;
					НовыйПолуфабрикат.Характеристика = СтрокаМатериала.Характеристика;
					НовыйПолуфабрикат.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
					НовыйПолуфабрикат.Этап = СтрокаМатериала.ИсточникПолученияПолуфабриката;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ПроизводимыеПолуфабрикаты.Индексы.Добавить("Номенклатура,Характеристика,СтатьяКалькуляции,Этап");
		
		Для Каждого СтрокаТрудозатрат Из ДанныеСпецификации.Трудозатраты Цикл
			
			ПлановыеТрудозатраты = СтруктураДанных.Движения.ПлановыеТрудозатраты; // ТаблицаЗначений
			НоваяТрудозатрата = ПлановыеТрудозатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТрудозатрата, СтрокаТрудозатрат);
			НоваяТрудозатрата.КлючПартия = УидХарактеристики;
			НоваяТрудозатрата.Период = ПериодКалькуляции;
			НоваяТрудозатрата.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НоваяТрудозатрата.Подразделение = СтрокаТрудозатрат.ПодразделениеЭтапа;
			НоваяТрудозатрата.Количество = СтрокаТрудозатрат.Количество * Числитель / Знаменатель;
			
			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаТрудозатрат.Этап;
			НоваяТрудозатрата.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);
			
		КонецЦикла;
		
		Для Каждого СтрокаМатериала Из ДанныеСпецификации.ВозвратныеОтходы Цикл
			
			ПлановыеМатериальныеЗатраты = СтруктураДанных.Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений
			НоваяСтрока = ПлановыеМатериальныеЗатраты.Добавить();
			НоваяСтрока.КлючПартия = УидХарактеристики;
			НоваяСтрока.Период = ПериодКалькуляции;
			НоваяСтрока.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НоваяСтрока.Подразделение = СтрокаМатериала.ПодразделениеЭтапа;
			НоваяСтрока.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
			НоваяСтрока.Номенклатура = СтрокаМатериала.Номенклатура;
			НоваяСтрока.Характеристика = СтрокаМатериала.Характеристика;
			НоваяСтрока.Количество = -СтрокаМатериала.КоличествоУпаковок * Числитель / Знаменатель
											* СтрокаМатериала.ДанныеУпаковки.Числитель / СтрокаМатериала.ДанныеУпаковки.Знаменатель;
			
			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаМатериала.Этап;
			НоваяСтрока.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);
			
			УсловияПоиска = Новый Структура("Номенклатура,Характеристика,СтатьяКалькуляции,Этап", 
				СтрокаМатериала.Номенклатура, СтрокаМатериала.Характеристика, СтрокаМатериала.СтатьяКалькуляции, СтрокаМатериала.Этап);
			Если ПроизводимыеПолуфабрикаты.НайтиСтроки(УсловияПоиска).Количество() > 0 Тогда
				НоваяСтрока.ЭтоПолуфабрикат = Истина;
			КонецЕсли;
			
		КонецЦикла;		
		
		НоваяСтрока = РазузлованныеОбъекты.Добавить();
		НоваяСтрока.Спецификация = СпецификацияСХарактеристикой.Спецификация; 
		НоваяСтрока.КлючПартия = УидХарактеристики;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
КонецПроцедуры
