
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если НЕ СтруктураПараметров.ДокРО.Пустая() Тогда
		
		Объект.Склад = СтруктураПараметров.ДокРО.Получатель;
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,СХК_Этаж",СтруктураПараметров.ДокРО.Получатель,Объект.СХК_Этаж));
		
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Этаж",Объект.СХК_Этаж);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

&НаКлиенте
Процедура СХК_ЭтажОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ЗаполнитьЭтаж(ВыбранноеЗначение);
КонецПроцедуры                      

&НаСервере
Процедура ЗаполнитьЭтаж(Этаж)
	СХК_Этаж = Этаж;
КонецПроцедуры


&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

