
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если НЕ СтруктураПараметров.ДокРО.Пустая() Тогда
		
		Объект.Склад = СтруктураПараметров.ДокРО.Получатель;

		Если Объект.СХК_Этаж.Пустая() = Истина Тогда
			УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,СХК_Этаж",Объект.Склад,Объект.СХК_Этаж));
		КонецЕсли;
		Объект.СХК_Этаж = Справочники.СкладскиеПомещения.НайтиПоНаименованию("Цех Мюсли 1 этаж");

	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Этаж",Объект.СХК_Этаж);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

&НаКлиенте
Процедура СХК_ЭтажОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ЗаполнитьЭтаж(ВыбранноеЗначение);
КонецПроцедуры                      

&НаСервере
Процедура ЗаполнитьЭтаж(Этаж)
	Объект.СХК_Этаж = Этаж;
КонецПроцедуры


&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

