Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроекФормы, Истина);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;   
	
КонецПроцедуры 

Процедура УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы)
	ПараметрДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");  
	ПараметрДатаОтчета.Использование = Истина;
	
КонецПроцедуры


#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	//ДатаНачала = ТекущаяДата()-180*86400;
	//ДатаОкончания = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	//
	//// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	//	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	//	
	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);
	//
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//
	ТабОстатки = Платежи();
		//
	ВнешниеНаборыДанных = Новый Структура("ТабОстатки", ТабОстатки);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	//ПроцессорВывода.ЗакончитьВывод();
	

КонецПроцедуры    
#КонецОбласти 


Функция Платежи()  
	
	ДатаОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.Дата;;	
	//ДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение.ДатаНачала;	
	
	Таб = Новый ТаблицаЗначений; 
	Таб.Колонки.Добавить("Номенклатура");
	Таб.Колонки.Добавить("Серия");
	Таб.Колонки.Добавить("Ячейка");
	Таб.Колонки.Добавить("ВНаличииОстатокГП");
	//Таб.Колонки.Добавить("ВНаличииОстатокЯчейка");  
	Таб.Колонки.Добавить("ВНаличииОстаток");  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Серия КАК Серия,
	               |	СУММА(ВложенныйЗапрос.ВНаличииОстатокГП) КАК ВНаличииОстатокГП,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |		СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |		0 КАК ВНаличииОстатокГП,
	               |		СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстатокЯчейка
	               |	ИЗ
	               |		РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОтчета, ) КАК СХК_ТоварыНаСкладеОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ТоварыНаСкладахОстатки.Номенклатура,
	               |		ТоварыНаСкладахОстатки.Серия.Наименование,
	               |		ТоварыНаСкладахОстатки.ВНаличииОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОтчета, Склад = &СкладГП) КАК ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |		ПО ВложенныйЗапрос.Серия = СХК_ТоварыНаСкладеОстатки.Серия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Серия,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Отгружается,
	               |	ТоварыКОтгрузке.Серия КАК Серия,
	               |	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК РО
	               |ПОМЕСТИТЬ ВТЗКОтгрузке
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |		ПО (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки)
	               |			И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия = ТоварыКОтгрузке.Серия)
	               |ГДЕ
	               |	ТоварыКОтгрузке.ДокументОтгрузки.Дата >= &Дата
	               |	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен))
	               |	И ТоварыКОтгрузке.Склад = &СкладГП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыКОтгрузке.Серия,
	               |	ТоварыКОтгрузке.Номенклатура,
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗ.Серия КАК Серия,
	               |	СУММА(СХК_СписаниеЯчейки.Количество) КАК Отгружается
	               |ПОМЕСТИТЬ ВТЗКОтгрузкеИтог
	               |ИЗ
	               |	ВТЗКОтгрузке КАК ВТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СХК_СписаниеЯчейки.СобранныеТовары КАК СХК_СписаниеЯчейки
	               |		ПО ВТЗ.РО = СХК_СписаниеЯчейки.Ссылка.ДокОснования
	               |			И ВТЗ.Серия = СХК_СписаниеЯчейки.Серия
	               |ГДЕ
	               //|	СХК_СписаниеЯчейки.Ссылка.Собран = ЛОЖЬ
	               |	СХК_СписаниеЯчейки.Ссылка.Проведен = Истина
	               |	И СХК_СписаниеЯчейки.Ссылка.Дата >= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗ.Серия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗ.Номенклатура КАК Номенклатура,
	               |	ВТЗ.Серия КАК Серия,
	               |	ВТЗ.ВНаличииОстатокГП КАК ВНаличииОстатокГП,
	               |	ВТЗ.Ячейка КАК Ячейка,
	               |	ВТЗ.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	ТоварыКОтгрузкеОстатки.Отгружается КАК Отгружается
	               |ИЗ
	               |	ВТЗ КАК ВТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗКОтгрузкеИтог КАК ТоварыКОтгрузкеОстатки
	               |		ПО ВТЗ.Серия = ТоварыКОтгрузкеОстатки.Серия.Наименование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗ.Номенклатура,
	               |	ВТЗ.Серия,
	               |	ВТЗ.ВНаличииОстатокГП,
	               |	ВТЗ.Ячейка,
	               |	ВТЗ.ВНаличииОстаток,
	               |	ТоварыКОтгрузкеОстатки.Отгружается";
	              // |ГДЕ
	              // |	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	Запрос.УстановитьПараметр("ДатаОтчета",КонецДня(ДатаОтчета)); 
	Запрос.УстановитьПараметр("Дата",Дата("01.01.2026 00:00:00")); 
	Запрос.УстановитьПараметр("СкладГП",Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции")); 

	Таб =  Запрос.Выполнить().Выгрузить();  
	Таб.Свернуть("Номенклатура,Серия,Ячейка,ВНаличииОстатокГП,Отгружается","ВНаличииОстаток");	
	Возврат Таб;
	
 КонецФункции  