Функция НайтиРО(УИД) Экспорт

	Идентификатор = Новый УникальныйИдентификатор(УИД);
	Возврат  Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Идентификатор);
	
КонецФункции


Функция ПолучитьПользователяПоШК(ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ШтрихкодСотрудника.Ссылка КАК Ссылка,
	               |	СХК_ШтрихкодСотрудника.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Справочник.СХК_ШтрихкодСотрудника КАК СХК_ШтрихкодСотрудника
	               |ГДЕ
	               |	СХК_ШтрихкодСотрудника.ШтрихКод = &ШтрихКод
	               |	И СХК_ШтрихкодСотрудника.Блокировка = ЛОЖЬ
	               |	И СХК_ШтрихкодСотрудника.Сотрудник.Недействителен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ШтрихКод",ШК); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Сотрудник;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
						
КонецФункции    

Процедура ИзменитьТайминг(ИмяПользователя) Экспорт
	Сотр = Пользователи.ПользовательПоНаименованию(ИмяПользователя); 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотр);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда 
		НовыйНомер = НаборЗаписей.Добавить();
		НовыйНомер.Пользователь = Сотр;
		НовыйНомер.Период = ТекущаяДата(); 
	Иначе
		НовыйНомер = НаборЗаписей[0];
		НовыйНомер.Период = ТекущаяДата();
	КонецЕсли;
	НаборЗаписей.Записать(Истина); 

КонецПроцедуры   

Функция ПроверитьТайминг(Сотрудник) Экспорт 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
	НаборЗаписей.Прочитать();

	Тайминг = НаборЗаписей[0];
	Если ТекущаяДата() - Тайминг.Период > 900 Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


      Функция ПоискНоменклатурыПоШК(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";  
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Номенклатура;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции  

 Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура,СерииНоменклатуры) Экспорт
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",Номенклатура.ЕдиницаИзмерения); 
	 Если ЗначениеЗаполнено(СерииНоменклатуры.СХК_Упаковка) Тогда
	 	СЗ.Вставить("Числитель",СерииНоменклатуры.СХК_Упаковка.Числитель); 
	Иначе
	 	СЗ.Вставить("Числитель",Номенклатура.ЕдиницаИзмерения.Числитель); 
	КонецЕсли;
	
	Возврат СЗ;
	
 КонецФункции

