
&После("ПриЗаписи")
Процедура Расш1_ПриЗаписи(Отказ)
	Если СХК_ТСДСклад.ПоискШтрихКода(Ссылка).Количество() = 0 Тогда
		СХК_ТСДСклад.СоздатьШтрихкод(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
	Если ГруппаДоступа = Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Готовая продукция") Тогда
		Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_РедактированиеГотовойПродукции")  Тогда 
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
