
&После("ПриЗаписи")
Процедура Расш1_ПриЗаписи(Отказ)
	Если ВидНоменклатуры <> Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая продукция: Батончики") Тогда
		Если СХК_ТСДСклад.ПоискШтрихКодаНоменклатура(Ссылка).Количество() = 0 Тогда
			Парам = Новый Структура;
			Парам.Вставить("Номенклатура",Ссылка);
			Парам.Вставить("СерииНоменклатуры",Справочники.СерииНоменклатуры.ПустаяСсылка());
			СХК_ТСДСклад.СоздатьШтрихкод(Парам);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


//@skip-check module-structure-method-in-regions
&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
	Если ГруппаДоступа = Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Готовая продукция") Тогда
		Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_РедактированиеГотовойПродукции")  Тогда 
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
