
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Элементы.ДекорацияОшибка.Заголовок = "";	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь; 
		ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка(); 
		Объект.Склад = Справочники.Склады.НайтиПоНаименованию("ЦМ Цех Мюсли"); 
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,СХК_Этаж",Объект.Склад,Объект.СХК_Этаж));
		Объект.СХК_Этаж = Справочники.СкладскиеПомещения.НайтиПоНаименованию("Цех Мюсли 1 этаж"); 
		
		ТабРО.Параметры.УстановитьЗначениеПараметра("Автор",Справочники.Пользователи.НайтиПоНаименованию("Пенкина Марина Александровна").Ссылка);
		ТабРО.Параметры.УстановитьЗначениеПараметра("Дата",НачалоДня(ТекущаяДата())-2*86400);
		ТабРО.Параметры.УстановитьЗначениеПараметра("Получатель",Объект.Склад);
		ТабРО.Параметры.УстановитьЗначениеПараметра("Склад",Справочники.Склады.НайтиПоНаименованию("СМ Склад сырья и материалов"));
		ТабРО.Параметры.УстановитьЗначениеПараметра("Этаж",Объект.СХК_Этаж.Наименование);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТаблицаВидимость(Видимость)
	Элементы.ГруппаТаблица.Видимость = Видимость;	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаформыВидимость(Видимость)
	Элементы.ГруппаФормы.Видимость = Видимость;	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаРОВидимость(Видимость)
	Элементы.ГруппаРО.Видимость = Видимость;
	Элементы.ТабРО.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборПомещения(Значение, ДопПараметры) Экспорт
	Элементы.ДекорацияОшибка.Заголовок = "";	
	Если ЗначениеЗаполнено(Значение) Тогда 
		Если Не Значение.Этаж.Пустая() Тогда
			Объект.СХК_Этаж = Значение.Этаж;
			ЗаполнитьТаблицуТоваров();
			Если ТаблицаТоваров.Количество() >=1 Тогда 
				ГруппаТаблицаВидимость(Истина);
				ГруппаРОВидимость(Ложь);
				ГруппаформыВидимость(Ложь);
			КонецЕсли;
			
		Иначе
			Элементы.ДекорацияОшибка.Заголовок = "Повторите сканирование ордера"; 
			ГруппаТаблицаВидимость(Ложь)       ;
			ГруппаРОВидимость(Истина);
			ГруппаформыВидимость(Истина);
			АктивироватьПоиск();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭтажаНаКлиенте()
	
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ДокРО",ЭтаФорма.ДокРО );
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборПомещения", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаПомещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//ЗаполнитьТаблицуТоваров(Текст); 
	Если НайтиРО(Текст) = Истина Тогда
		ВыборЭтажаНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиРО(УИД)
	
	Элементы.ДекорацияОшибка.Заголовок = "";	
	ТаблицаТоваров.Очистить(); 
	
	Идентификатор = Новый УникальныйИдентификатор(УИД);
	ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Идентификатор);
	
	Если Не ДокРО.Пустая() И ДокРО.Проведен Тогда
		Если ДокРО.СХК_ПринятТСД = Истина Тогда
			ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
			Элементы.ДекорацияОшибка.Заголовок = "Документ уже принят";	
		Иначе
			Возврат Истина;	
		КонецЕсли;
		
	Иначе
		ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		Элементы.ДекорацияОшибка.Заголовок = "Документ не найден";	
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуТоваров()
	//Элементы.ДекорацияОшибка.Заголовок = "";	
	ТаблицаТоваров.Очистить();
	//Идентификатор = Новый УникальныйИдентификатор(УИД);
	//ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПолучитьСсылку(Идентификатор);
	
	Если Не ДокРО.Пустая()  Тогда                                    
		ТаблицаТоваров.Загрузить(ДокРО.ОтгружаемыеТовары.Выгрузить());
		
		//Объект.Склад = Справочники.Склады.НайтиПоНаименованию("ЦМ Цех Мюсли");
		
		//Если Объект.СХК_Этаж.Пустая() = Истина Тогда
		//	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад,СХК_Этаж",ДокРО.Получатель,Объект.СХК_Этаж));
		//КонецЕсли;
		
		//Объект.СХК_Этаж = Справочники.СкладскиеПомещения.НайтиПоНаименованию("Цех Мюсли 1 этаж");
		
	Иначе  
		ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		Элементы.ДекорацияОшибка.Заголовок = "Документ не найден";	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПринятьНаСервере()     
	Перем Результат;
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");
	
	Док = ЭтотОбъект.ДокРО.ПолучитьОбъект();
	ДокПР = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ДокПР.Дата = ТекущаяДата();
	ДокПР.Склад = Док.Получатель;//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции") ; 
	ДокПР.Помещение = Объект.СХК_Этаж;
	//Если СкладПолучатель = Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации") Тогда
	//	ДокПР.Помещение =  Справочники.СкладскиеПомещения.НайтиПоНаименованию("ЦК Цех Комплектации");
	//КонецЕсли;
	
	ДокПР.Распоряжение = Док.ТоварыПоРаспоряжениям[0].Распоряжение; 
	ДокПР.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;  //КПоступлению
	ДокПР.ДатаВходящегоДокумента = ТекущаяДата();
	ДокПР.Отправитель = Док.Склад ;
	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокПР.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению; 
	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.Исполнитель = ЭтаФорма.Сотрудник;
	
	ТабТ =  ТаблицаТоваров.Выгрузить();
	ПараметрыОтбора = Новый Структура("Принять",Истина);
	ТабТН = ТабТ.Скопировать(ПараметрыОтбора);
	
	Для Каждого стр из ТабТН Цикл 
		НовСтр = ДокПР.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
		Если стр.СтатусУказанияСерий = 14 Тогда
			НовСтр.СтатусУказанияСерий = 4;
		КонецЕсли;
	КонецЦикла;
	
	Попытка 
		ДокПР.Записать(РежимЗаписиДокумента.Проведение); 
	
		Док.СХК_ПринятТСД = Истина;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Успех = Истина;
	Исключение 
		ДокПР.Записать(РежимЗаписиДокумента.Запись);
		Результат.ТекстОшибки = "Документ Приходный Ордер На Товары не записан";	
		
	КонецПопытки;
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Процедура Принять(Команда)
	РезультатСервера  = ПринятьНаСервере();
	
	Если НЕ РезультатСервера.Успех Тогда 
		//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		//ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	Иначе	
		ГруппаТаблицаВидимость(Ложь)       ; 
		ГруппаРОВидимость(Истина);    
		ГруппаформыВидимость(Истина);
		
		АктивироватьПоиск();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() Экспорт
	
	ЭтаФорма.Элементы.СканQR.РедактированиеТекста = Истина;
	ОчиститьШКСервер(); 
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	СканQR = "";
КонецПроцедуры


&НаКлиенте
Процедура СХК_ЭтажНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СХК_ЭтажПриИзмененииНаСервере()
	ТабРО.Параметры.УстановитьЗначениеПараметра("Этаж",Объект.СХК_Этаж.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура СХК_ЭтажПриИзменении(Элемент)
	СХК_ЭтажПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТабРОВыборНаСервере(СсылкаРО)
	ЭтотОбъект.ДокРО = СсылкаРО ;
КонецПроцедуры

&НаКлиенте
Процедура ТабРОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТабРОВыборНаСервере(Элемент.ТекущиеДанные.Ссылка); 
	ВыборЭтажаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	ГруппаТаблицаВидимость(Ложь)       ; 
	ГруппаРОВидимость(Истина); 
	ГруппаформыВидимость(Истина);
	АктивироватьПоиск();
КонецПроцедуры



&НаКлиенте
Процедура ТаблицаТоваровПриАктивизацииСтроки(Элемент) 
	//СтандартнаяОбработка = Ложь;
	# Если МобильныйКлиент Тогда
 	Если Элемент.ТекущиеДанные.Принять = Ложь тогда
		Элемент.ТекущиеДанные.Принять = Истина;
	Иначе
		Элемент.ТекущиеДанные.Принять = Ложь;
	КонецЕсли;		
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле <> Неопределено  Тогда
		//ВЗнач	= Неопределено;
		//Если ВвестиЗначение(ВЗнач, "Выберите магазин", Тип("СправочникСсылка.Склады")) Тогда
		//	ТД = Объект.ТоварыКДоставке[ВыбраннаяСтрока];
		//	ТД.АдресИсточник	= ВЗнач;
		//КонецЕсли;
	КонецЕсли;	
	// Вставить содержимое обработчика.
КонецПроцедуры




