&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь;
	КонецЕсли;
    //Сообщить(ЭтаФорма.Сотрудник);
КонецПроцедуры



&НаКлиенте
Процедура ГП(Команда) 
	ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтаФорма.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаАвторизации", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.Форма", _Параметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыФормаАвторизации(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура СМ(Команда)  
	ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтаФорма.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаАвторизации", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_Форма", _Параметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
