&НаКлиенте
Процедура ОбработатьЗакрытиеФормыМС(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСканРО(Команда)
		ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтотОбъект.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		ППараметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыМС", ЭтотОбъект);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_Форма", ППараметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Элементы.ДекорацияОшибка.Заголовок = "";	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьСканРО();
КонецПроцедуры
#КонецОбласти



&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьСканРО() Экспорт 

	ЭтотОбъект.Элементы.СканQR.РедактированиеТекста = Истина;
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры             
