&НаКлиенте
Процедура ОбработатьЗакрытиеФормыМС(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСканРО(Команда)
		ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтотОбъект.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		ППараметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыМС", ЭтотОбъект);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_Форма", ППараметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Элементы.ДекорацияОшибка.Заголовок = "";	
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьСканРО();
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура ТаблицаТоваровПриАктивизацииСтроки(Элемент)
	# Если МобильныйКлиент Тогда
 	Если Элемент.ТекущиеДанные.Принять = Ложь тогда
		Элемент.ТекущиеДанные.Принять = Истина;
	Иначе
		Элемент.ТекущиеДанные.Принять = Ложь;
	КонецЕсли;		
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле <> Неопределено  Тогда
		//ВЗнач	= Неопределено;
		//Если ВвестиЗначение(ВЗнач, "Выберите магазин", Тип("СправочникСсылка.Склады")) Тогда
		//	ТД = Объект.ТоварыКДоставке[ВыбраннаяСтрока];
		//	ТД.АдресИсточник	= ВЗнач;
		//КонецЕсли;
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура Принять(Команда)
	РезультатСервера  = ПринятьНаСервере();
	
	Если НЕ РезультатСервера.Успех Тогда 
		//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		//ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	Иначе	
		ГруппаДокументаВидимость(Ложь)       ; 
		ГруппаШапка(Истина);    

		
		АктивироватьСканРО();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаШапка(Видимость)
	Элементы.ГруппаШапка.Видимость = Видимость;	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаДокументаВидимость(Видимость)
	Элементы.ГруппаДокумента.Видимость = Видимость;	
КонецПроцедуры

&НаСервере
Функция ПринятьНаСервере()     
	Перем Результат;
	
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");
	
	Док = ЭтотОбъект.ДокРО.ПолучитьОбъект();
	ДокПР = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ДокПР.Дата = ТекущаяДата();
	ДокПР.Склад = Док.Получатель;//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции") ; 
	ДокПР.Отправитель = Док.Склад;
	ДокПР.Распоряжение = Док.ТоварыПоРаспоряжениям[0].Распоряжение; 
	ДокПР.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;  //КПоступлению
	ДокПР.ДатаВходящегоДокумента = ТекущаяДата();

	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокПР.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению; 
	ДокПР.Ответственный = ЭтаФорма.Сотрудник;
	ДокПР.Исполнитель = ЭтаФорма.Сотрудник;
	
	ТабТ =  ТаблицаТоваров.Выгрузить();
	ПараметрыОтбора = Новый Структура("Принять",Истина);
	ТабТН = ТабТ.Скопировать(ПараметрыОтбора);
	
	Для Каждого стр из ТабТН Цикл 
		НовСтр = ДокПР.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
		Если стр.СтатусУказанияСерий = 14 Тогда
			НовСтр.СтатусУказанияСерий = 4;
		КонецЕсли;
	КонецЦикла;
	
	Попытка 
		ДокПР.Записать(РежимЗаписиДокумента.Проведение); 
	
		Док.СХК_ПринятТСД = Истина;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Успех = Истина;
	Исключение 
		ДокПР.Записать(РежимЗаписиДокумента.Запись);
		Результат.ТекстОшибки = "Документ Приходный Ордер На Товары не записан";	
		
	КонецПопытки;
	
	Возврат Результат;		
	
КонецФункции

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЗаполнитьТаблицуТоваровПоРО(Текст);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваровПоРО(УИД)
	
	Элементы.ДекорацияОшибка.Заголовок = "";	
	ТаблицаТоваров.Очистить(); 
	
	Идентификатор = Новый УникальныйИдентификатор(УИД);
	ЭтотОбъект.ДокРО = Обработки.СХК_МобильныйСклад.НайтиРО(УИД).Ссылка;
	
	Если Не ДокРО.Пустая() И ДокРО.Проведен Тогда
		Если ДокРО.СХК_ПринятТСД = Истина Тогда
			ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
			Элементы.ДекорацияОшибка.Заголовок = "Документ уже принят";	
		Иначе
			ТаблицаТоваров.Загрузить(ДокРО.ОтгружаемыеТовары.Выгрузить());
			Элементы.ГруппаДокумента.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		ЭтотОбъект.ДокРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		Элементы.ДекорацияОшибка.Заголовок = "Документ не найден";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканРО() Экспорт 

	ЭтотОбъект.Элементы.СканQR.РедактированиеТекста = Истина;
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры             
