   Функция ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер) Экспорт
	   
	   //УстановитьОтключениеБезопасногоРежима(Истина);
	   ГенераторQRКода = КомпонентаФормированияQRКода();
	   Если ГенераторQRКода = Неопределено Тогда
		   Возврат Неопределено;
	   КонецЕсли;
	   
	   Попытка
		   ДвоичныеДанныеКартинки = ГенераторQRКода.GenerateQRCode(QRСтрока, УровеньКоррекции, Размер);
	   Исключение
		   ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование QR-кода'", КодОсновногоЯзыка()),
		   УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	   КонецПопытки;
	   
	   Возврат ДвоичныеДанныеКартинки;
	   
   КонецФункции 
   
   Функция КодОсновногоЯзыка() Экспорт
	   
	   Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	   
   КонецФункции
   
   Функция КомпонентаФормированияQRКода()
	   
	   ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации QR-кода. Подробности в журнале регистрации.'");
	   
	   QRCodeGenerator = ПодключитьКомпонентуИзМакета("QRCodeExtension", "ОбщийМакет.КомпонентаПечатиQRКода");
	   Если QRCodeGenerator = Неопределено Тогда
		   #Если Клиент Тогда
			   Сообщить(ТекстОшибки);
		   #КонецЕсли
	   КонецЕсли;
	   
	   Возврат QRCodeGenerator;
	   
   КонецФункции
   
   Функция ПодключитьКомпонентуИзМакета(Идентификатор, ПолноеИмяМакета) Экспорт
	   
	   ПодключаемыйМодуль = Неопределено;
	   
	   Местоположение = ПолноеИмяМакета;
	   СимволическоеИмя = Идентификатор + "SymbolicName";
	   
	   Если ПодключитьВнешнююКомпоненту(Местоположение, СимволическоеИмя) Тогда
		   
		   Попытка
			   ПодключаемыйМодуль = Новый("AddIn." + СимволическоеИмя + "." + Идентификатор);
			   Если ПодключаемыйМодуль = Неопределено Тогда
				   ВызватьИсключение НСтр("ru = 'Оператор Новый вернул Неопределено'");
			   КонецЕсли;
		   Исключение
			   ПодключаемыйМодуль = Неопределено;
			   ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		   КонецПопытки;
		   
		   Если ПодключаемыйМодуль = Неопределено Тогда
			   
			   ТекстОшибки = НСтр("ru = 'Не удалось создать объект внешней компоненты ""%1"", подключенной на сервере
			   |из макета ""%2"",
			   |по причине:
			   |%3'");
			   
			   ЗаписьЖурналаРегистрации(
			   НСтр("ru = 'Подключение внешней компоненты на сервере'",
			   КодОсновногоЯзыка()),
			   УровеньЖурналаРегистрации.Ошибка,,,
			   ТекстОшибки);
			   
		   КонецЕсли;
		   
	   Иначе
		   
		   ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту ""%1"" на сервере
		   |из макета ""%2""
		   |по причине:
		   |Метод ПодключитьВнешнююКомпоненту вернул Ложь.'");
		   
		   ЗаписьЖурналаРегистрации(
		   НСтр("ru = 'Подключение внешней компоненты на сервере'",
		   КодОсновногоЯзыка()),
		   УровеньЖурналаРегистрации.Ошибка,,,
		   ТекстОшибки);
		   
	   КонецЕсли;
	   
	   Возврат ПодключаемыйМодуль;
	   
   КонецФункции
