
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если  Параметры.Контрагент <> "" Тогда 
		Контрагент =  ОбъектEdi(Параметры.Контрагент);
		СписокРЦ.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);	
	КонецЕсли;
	 		
КонецПроцедуры        


&НаСервере
Функция ОбъектEdi(КонтрагентСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	КонтурEDI_ДополнительныеРеквизиты.Объект КАК Объект,
|	КонтурEDI_ДополнительныеРеквизиты.Свойство КАК Свойство,
|	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение,
|	КонтурEDI_ДополнительныеРеквизиты.ЗначениеСтрока КАК ЗначениеСтрока
|ИЗ
|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
|ГДЕ
|	КонтурEDI_ДополнительныеРеквизиты.Свойство = ""ПартнерКонтрагента""
|	И 
|	КонтурEDI_ДополнительныеРеквизиты.Объект = &Объект"; 
	Запрос.УстановитьПараметр("Объект",КонтрагентСсылка); 
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда  
		Возврат Рез.Значение;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура СписокРЦВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокПараметров = Новый Структура;  
    СписокПараметров.Вставить("РЦ", ЭтаФорма.Элементы.СписокРЦ.ТекущиеДанные.Ссылка);  
    СписокПараметров.Вставить("Рентабельность", ЭтаФорма.Элементы.СписокРЦ.ТекущиеДанные.СХК_Рентабельность);  
    ОповеститьОВыборе(СписокПараметров); 
КонецПроцедуры

