//
//&НаКлиенте
//Процедура Сборка(Команда)
//
//	ПараметрыФормыОстатки = Новый Структура;
//	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
//	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
//	//Создаем структуру с параметрами, которые передадим во вторую форму
//	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
//	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.СписокОрдеров", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
//
//КонецПроцедуры 
//
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры


&НаКлиенте
Процедура Приемка(Команда)
	ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтаФорма.Сотрудник );
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ЖурналЗаказыПоставщику", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


&НаКлиенте
Процедура Выход(Команда)
	ЗавершитьРаботуСистемы(ложь);
КонецПроцедуры


&НаКлиенте
Процедура Перемещение(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("СМ_ЖурналПеремещения",СтруктураПараметры);
КонецПроцедуры


&НаКлиенте
Процедура ВозвратМатериалов(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("СМ_ЖурналРО",СтруктураПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбор(ИмяФормы,СтруктураПараметры)
	ПараметрыФормыОстатки = Новый Структура;
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма."+ИмяФормы, _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура Брак(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("ФормаБрак",СтруктураПараметры);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	//СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	//
	//Если ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
	//	ЭтаФорма.Сотрудник = СтруктураПараметров.Пользователь;
	//КонецЕсли;
    ЭтаФорма.Сотрудник = Пользователи.АвторизованныйПользователь();
	Элементы.Перемещение.Заголовок = "ПЕРЕМЕЩЕНИЕ в "+Символы.ПС+"Цех"; 
	//Сообщить(ЭтаФорма.Сотрудник);
КонецПроцедуры

&НаКлиенте
Процедура ПриемкаЦех(Команда)
	ЭтаФорма.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",ЭтаФорма.Сотрудник );
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ЖурналРО", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры
