&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ДокументРО = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПеремещения)); 
	Товары.Сортировать("КоличествоУпаковокСобрано Возр,Номенклатура Возр");
	
	Для Каждого стр из Товары Цикл
			
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ТекущиеДанные.КоличествоУпаковокСобрано > 0 И Элемент.ТекущиеДанные.КоличествоУпаковокСобрано <> Элемент.ТекущиеДанные.КоличествоУпаковок Тогда
		ВывестиВопрос(Элемент.ТекущиеДанные);	
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//ОткрытьФорму("ВнешняяОбработка.СХК_МобильныйСклад.Форма.СМ_ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВывестиВопрос(Данные)
	
	//@skip-check undefined-function
	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерииНоменклатуры","");
		СтруктураСтрока.Вставить("КоличествоУпаковокСобрано",0);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		ОтветРедактирования = Вопрос("Изменить позицию?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Изменить позицию?" // (необ.) заголовок
		//"По данному ордеру все собрано !!!"
		);
		Если ОтветРедактирования = КодВозвратаДиалога.Да Тогда
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные );	 
			ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			//@skip-check notify-description-to-server-procedure
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
			ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабЧасть()	
КонецПроцедуры




&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	               |	ВЫБОР
	               |		КОГДА ЗаказПоставщикуТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ВложенныйЗапрос.Количество
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КоличествоУпаковокСобрано,
	               |	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ЗаказПоставщикуТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |			ТОГДА 1
	               |		ИНАЧЕ ЕСТЬNULL(ВложенныйЗапрос.Ссылка, 1)
	               |	КОНЕЦ КАК СсылкаРО,
	               |	ЗаказПоставщикуТовары.ОкончаниеПоступления КАК ОкончаниеПоступления,
	               |	ЗаказПоставщикуТовары.НачалоОтгрузки КАК НачалоОтгрузки,
	               |	ЗаказПоставщикуТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ЗаказПоставщикуТовары.Назначение КАК Назначение
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	Документ.ЗаказНаПеремещение.Товары КАК ЗаказПоставщикуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	               |			ЕСТЬNULL(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество, 0) КАК Количество,
	               |			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
	               |			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
	               |			ВЫБОР
	               |				КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
	               |					ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка
	               |				ИНАЧЕ 2
	               |			КОНЕЦ КАК Ссылка,
	               |			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус КАК Статус
	               |		ИЗ
	               |			Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |		ГДЕ
	               |			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	               |			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение
	               |			И ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И (ВложенныйЗапрос.Серия = ЗаказПоставщикуТовары.Серия)
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗ.Номенклатура КАК Номенклатура,
	               |	ВТЗ.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ВТЗ.Упаковка КАК Упаковка,
	               |	ВТЗ.СерииНоменклатуры КАК СерииНоменклатуры,
	               |	ВТЗ.СсылкаРО КАК СсылкаРО,
	               |	ВТЗ.ОкончаниеПоступления КАК ОкончаниеПоступления,
	               |	ВТЗ.НачалоОтгрузки КАК НачалоОтгрузки,
	               |	ВТЗ.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ВТЗ.Назначение КАК Назначение,
	               |	СУММА(ВТЗ.КоличествоУпаковокСобрано) КАК КоличествоУпаковокСобрано
	               |ИЗ
	               |	ВТЗ КАК ВТЗ
	               |ГДЕ
	               |	ВТЗ.СсылкаРО <> 2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗ.Номенклатура,
	               |	ВТЗ.КоличествоУпаковок,
	               |	ВТЗ.Упаковка,
	               |	ВТЗ.СерииНоменклатуры,
	               |	ВТЗ.СсылкаРО,
	               |	ВТЗ.ОкончаниеПоступления,
	               |	ВТЗ.НачалоОтгрузки,
	               |	ВТЗ.ВариантОбеспечения,
	               |	ВТЗ.Назначение";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаКлиенте
Процедура Переместить(Команда)
	
	РезультатСервера = ПереместитьПоЗаказу(); 
	Если НЕ РезультатСервера.Успех Тогда 
		//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПоступления", ЭтотОбъект);
		//ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
	Иначе
		ТабДок = СформироватьВнешнююПечатнуюФорму(РезультатСервера.ДокументРО); 
		ТабДок.РазмерСтраницы = "Letter";
		ТабДок.Автомасштаб = Истина;  
		ТабДок.ИмяПринтера = "Pantum-SkladCM";

        ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	

КонецПроцедуры   

&НаСервере
Функция ПереместитьПоЗаказу() 

	Перем Результат;
	Результат = Новый Структура("Успех, ТекстОшибки,ДокументРО", Ложь, "",Документы.РасходныйОрдерНаТовары.ПустаяСсылка());
	
	/////////////// ПеремещениеТоваров 
	СтруктураП = Новый Структура;
	СтруктураП.Вставить("ЗаполнятьПоОрдеру",Истина);
	СтруктураП.Вставить("Статус",Перечисления.СтатусыПеремещенийТоваров.Принято);
	СтруктураП.Вставить("Дата",ТекущаяДата());
	СтруктураП.Вставить("ИмяДокумента","ПеремещениеТоваров");
	СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаПеремещение");
	СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаПеремещение");
	СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение, НазначениеОтправителя"); 
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ДокументЗаказПеремещения.Ссылка);
	СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
	
	РеквизитыШапки = Новый Структура; 
	РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);
	РеквизитыШапки.Вставить("Организация",ДокументЗаказПеремещения.Организация);
	РеквизитыШапки.Вставить("СкладОтправитель",ДокументЗаказПеремещения.СкладОтправитель);
	РеквизитыШапки.Вставить("СкладПолучатель",ДокументЗаказПеремещения.СкладПолучатель);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
	РеквизитыШапки.Вставить("СпособДоставки",Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	
	СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
	ДокП = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокП.Заполнить(СтруктураП);
	ДокП.Дата = ТекущаяДата();
	ДокП.Записать(РежимЗаписиДокумента.Запись);
	
	ДокПТ = ДокП.Ссылка.ПолучитьОбъект();
	ДокПТ.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято; 
	
	Попытка 
		ДокПТ.Записать(РежимЗаписиДокумента.Проведение); 
		ДокРО = ПолучитьРасходныйОрдер(ДокументЗаказПеремещения.Ссылка);
		Если Не ДокРО.Пустая() Тогда
			ДокРО = ДокРО.ПолучитьОбъект();
			ДокРО.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
			ДокРО.Записать(РежимЗаписиДокумента.Проведение); 
            Результат.Успех = Истина;
			Результат.ДокументРО = ДокРО.Ссылка;
		КонецЕсли;
	Исключение  
		Результат.ТекстОшибки = "При перемещении произошла ошибка";
	КонецПопытки; 
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьРасходныйОрдер(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	               |ГДЕ
	               |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = Значение(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)";
	Запрос.УстановитьПараметр("Распоряжение",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	АктивироватьПолеСканШК();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеСканШК() 
	ОчиститьПолеНомерУПД(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПолеНомерУПД()
	СканШК = "";
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтрокаНоменклатуры = НайтиноменклатуруПоШК(Текст);
	Если ТипЗнч(СтрокаНоменклатуры) = Тип("Структура")  Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтрокаНоменклатуры );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.СМ_ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция НайтиноменклатуруПоШК(ШК)
	Ош = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"; 
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выбрать(); 
	
	Если Рез.Следующий() Тогда  
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Рез.Номенклатура);
		Отбор.Вставить("КоличествоУпаковокСобрано",0);
		Строки = Товары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строки[0]);
			Возврат СтруктураСтрока;
		КонецЕсли;
		КонецЕсли;
	
	Возврат Ош;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьВнешнююПечатнуюФорму(СсылкаНаДокумент)
	
	//// Находим ВПФ в справочнике БСП по точному названию
	СсылкаНаВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Расходный ордер на товары (внешняя QR-Код) (моб)");
		
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	
	МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаДокумент);
	
	ПараметрыИсточника = Новый Структура;                                                    
	ПараметрыИсточника.Вставить("ИдентификаторКоманды", "ПФ_РасходныйОрдерНаТоварыВнешняяФормаQR_моб");
	ПараметрыИсточника.Вставить("ОбъектыНазначения", МассивДокументов);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.ЗагрузитьЗначения(МассивДокументов);

	// Ключевое - вызов метода, который отвечает за формирование внешней печатной формы.
	// Сформированная печатная форма добавляется в таблицу КоллекцияПечатныхФорм
	ДополнительныеОтчетыИОбработки.ПечатьПоВнешнемуИсточнику(СсылкаНаВПФ, ПараметрыИсточника, 
																КоллекцияПечатныхФорм, ОбъектыПечати, Неопределено); 
																
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	Иначе                                                   
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли;                          
	
	Возврат ТабДок;
КонецФункции

